; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 779910 2 3 3 3 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image1 - mode
	image0 - mode
	spectrograph2 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Star5 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph2)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Star3)
	(have_image Star3 image1)
	(have_image Phenomenon4 image1)
	(have_image Star5 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite1 star3 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star3)
   goals met: 1 of 5
3. (turn_to satellite0 star3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star3)
   goals met: 2 of 5
4. (turn_to satellite0 star0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star0)
   goals met: 1 of 5
5. (turn_to satellite1 phenomenon4 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon4)
   goals met: 0 of 5
6. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 5
7. (turn_to satellite1 star3 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star3)
   goals met: 1 of 5
8. (turn_to satellite0 star5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star5)
   goals met: 1 of 5
9. (turn_to satellite1 phenomenon4 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon4)
   goals met: 0 of 5
10. (take_image satellite0 star5 instrument0 image0)
   added: (have_image star5 image0)
   goals met: 1 of 5
11. (turn_to satellite1 star3 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star3)
   goals met: 2 of 5
12. (turn_to satellite0 star3 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star3)
   goals met: 3 of 5
13. (turn_to satellite1 phenomenon4 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon4)
   goals met: 2 of 5
14. (take_image satellite0 star3 instrument0 image1)
   added: (have_image star3 image1)
   goals met: 3 of 5
15. (turn_to satellite1 star3 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star3)
   goals met: 4 of 5
16. (turn_to satellite0 phenomenon4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon4)
   goals met: 3 of 5
17. (take_image satellite0 phenomenon4 instrument0 image1)
   added: (have_image phenomenon4 image1)
   goals met: 4 of 5
18. (turn_to satellite0 star3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star3)
   goals met: 5 of 5
